abbess
abbot
able_seaman
actress
adonis
adulteress
adventuress
aircraftsman
aircrewman
alderman
altar_boy
amazon
ambassadress
ancestress
ape-man
apostle
archbishop
archdeacon
archduchess
archpriest
armiger
armiger
artilleryman
assemblyman
assemblywoman
au_pair_girl
augustinian
aunt
austin_friar
authoress
aviatrix
ayah
b-girl
babu
bacchant
bacchante
bachelor
bachelor_girl
backroom_boy
bag
bag_lady
baggage
baggageman
bagman
ball_boy
ball-buster
ballerina
ballet_master
ballet_mistress
bandsman
baritone
barmaid
baron
baron
baron
baroness
basileus
bass
bat_boy
batman
beadsman
beard
beggarman
beggarwoman
beguine
begum
beldam
bellboy
belle
belly_dancer
benedick
benefactress
best_man
bey
bey
big_brother
big_sister
black_man
black_woman
blade
blood_brother
bluestocking
boatman
bobbysoxer
bondman
bondman
bondsman
bondwoman
bondwoman
border_patrolman
boy
boy
boy_scout
boy_scout
boy_wonder
boyfriend
brahman
brakeman
bride
bride
bridesmaid
broad
broth_of_a_boy
brother
brother
brother
brother
brother-in-law
brownie
brunet
buddy
bull
bullyboy
burgrave
burgrave
busboy
bushman
bushman
businessman
businesswoman
butch
butler
cabin_boy
call_girl
cameraman
campfire_girl
canary
capo
career_girl
career_man
casanova
castrato
cat
catamite
cattleman
cavalier
cavalier
cavalryman
cavalryman
caveman
centurion
chachka
chairman_of_the_board
chambermaid
chapman
charon
charwoman
chatelaine
check_girl
choirboy
chorus_girl
church_father
cinderella
circe
city_man
clansman
clergyman
cleric
closet_queen
co-ed
coachman
coalman
coastguardsman
codger
coiffeur
coiffeuse
colleen
coloratura
comedienne
comedienne
comfort_woman
committeeman
committeewoman
company_man
concubine
conductress
confidante
confidence_man
congressman
contralto
coquette
cornishman
cornishwoman
councilman
councilwoman
count
countertenor
countess
countryman
countryman
countrywoman
countrywoman
cover_girl
cow
cowboy
cowboy
cowboy
cowgirl
craftsman
craftsman
craftsman
crewman
crewman
crown_prince
crown_princess
crown_princess
cub
cub_scout
cuckold
curandera
curandero
cyril
czar
czarina
dad
dairymaid
dairyman
dairyman
dalesman
dame
dame
damsel
dandy
danseur
daughter
daughter-in-law
dauphin
dayboy
daygirl
deacon
deacon
deaconess
deadbeat_dad
dean
debutante
deliveryman
demimondaine
den_mother
den_mother
dirty_old_man
divorcee
dog
doge
domestic_prelate
don
don_juan
donna
doorkeeper
doughboy
doyenne
draftsman
draftsman
dragoman
dragon
drum_majorette
drum_majorette
duchess
duenna
duke
dutch_uncle
eagle_scout
earl
earl_marshal
ejaculator
elder_statesman
elder_statesman
elector
embroideress
emir
emperor
empress
enchantress
enchantress
end_man
end_man
englishman
englishwoman
enlisted_man
enlisted_woman
ent_man
eparch
esquire
esquire
ethnarch
everyman
ex-boyfriend
ex-husband
ex-wife
exarch
exarch
exarch
excavator
executrix
eyeful
fairy_godmother
family_man
fancy_man
farm_boy
farm_girl
farmerette
fathead
father
father
father
father_figure
father-figure
father-in-law
fauntleroy
favorite_son
fellow
female
female
female_aristocrat
female_child
female_offspring
female_sibling
ferryman
feudal_lord
fiancee
fireman
first_baseman
first_lady
first_lady
fisherman
flamen
flapper
flibbertigibbet
flower_girl
flower_girl
footman
forefather
forefather
foreman
foreman
foremother
forewoman
forewoman
foster-brother
foster-daughter
foster-father
foster-mother
foster-nurse
foster-sister
foster-son
foundress
four-minute_man
franklin
freedman
freeman
frenchman
friar
front_man
frontiersman
frontierswoman
frump
fugleman
g-man
gagman
gagman
gal
galoot
gamine
gamine
ganger
garbage_man
gasman
gaucho
gay_man
geezer
geisha
gent
gentleman
gentlemen
gibson_girl
gillie
girl
girl
girl_friday
girl_scout
girl_wonder
girlfriend
girlfriend
gitana
gitano
goddaughter
godfather
godfather
godmother
godson
gold_digger
golf_widow
goliard
good_old_boy
governess
grand_duchess
grand_duke
granddaughter
grande_dame
grandee
grandfather
grandson
granny
grass_widower
gravida
great_granddaughter
great_grandfather
great_grandmother
great_grandson
great-aunt
great-nephew
great-niece
great-uncle
grocery_boy
groom
groom
groomsman
groundsman
groupie
guardsman
gunman
gunman
guy
hag
half_sister
handmaid
handyman
hangman
harridan
hatchet_man
hatchet_man
he
head_linesman
headman
headmistress
headsman
heidelberg_man
heiress
helmsman
her
her
heroine
herr
hers
herself
him
himself
his
hobbledehoy
holdup_man
holy_roman_emperor
homeboy
homeboy
homegirl
honest_woman
hooray_henry
horseman
horseman
horsewoman
hostess
hostess
housefather
housemother
housewife
huntress
husband
iceman
idolatress
imam
inamorata
inamorato
indiana
infantryman
ingenue
ingenue
instructress
irishman
irishwoman
iron_man
ironside
jacob
jane_doe
jawan
jewess
jezebel
jilt
jimdandy
john_doe
john_doe
jute
kaiser
kennan
king
king_of_england
king_of_france
king_of_the_germans
kinsman
kinswoman
klansman
knight_of_the_round_table
knight_templar
knight-errant
lackey
ladies
lady
lady
lady's_maid
ladylove
landlady
lass
lawman
layman
leading_lady
leading_man
letterman
libertine
liege
life_peer
light-o'-love
lighterman
limey
lineman
lineman
linesman
linkboy
little_brother
little_sister
liveryman
lobsterman
lollipop_lady
longbowman
loon
lord
lord_chancellor
lothario
lounge_lizard
lowerclassman
lumberman
ma
ma'am
macaroni
macho
madam
madam
madame
madwoman
maenad
maenad
mafioso
maharaja
maharani
maid
maid
maiden_aunt
mailman
male
male
male_aristocrat
male_chauvinist
male_child
male_offspring
male_sibling
malik
mamma
mammy
man
man
man
man
man
man_jack
man_of_letters
man_of_means
man-at-arms
manageress
mannequin
manservant
marchioness
marchioness
margrave
marksman
marquess
marquis
masseur
matriarch
matriarch
matron
matron
matron
matron_of_honor
may_queen
mayoress
mayoress
mediatrix
medicine_man
memsahib
men
mesne_lord
messenger_boy
mestiza
mestizo
meter_maid
middle-aged_man
midshipman
midwife
mikado
milady
miles_gloriosus
military_policeman
militiaman
milkman
mill-girl
millionairess
milord
minuteman
miracle_man
misogynist
miss
missus
mistress
mistress
mollycoddle
monk
monsieur
monsignor
mother
mother
mother
mother_figure
mother_hen
mother-in-law
mother's_boy
mother's_daughter
mother's_son
mover
mr.
mrs.
ms.
muffin_man
mullah
murderess
muscleman
muslimah
nabob
nan
nanny
nautch_girl
negotiatress
negress
nephew
newswoman
niece
night_watchman
niqaabi
novillero
nullipara
nun
nuncio
nymph
nymphet
nymphomaniac
oarsman
oarswoman
odalisque
office_boy
oilman
oilman
oklahoman
old_boy
old_boy
old_boy
old_lady
old_man
old_man
old_man
old_woman
one_of_the_boys
orangeman
ordinary
organization_man
ottoman
outdoorsman
outdoorswoman
pachuco
page
palatine
paperboy
parisienne
parlormaid
party_girl
party_man
pater
patriarch
patriarch
patriarch
patroness
pederast
peer
peer_of_the_realm
pendragon
peri
peter_pan
pharaoh
pilate
piltdown_man
pitchman
placeman
plainclothesman
plainsman
plowboy
plowman
poetess
point_man
point_man
point_woman
pointsman
police_matron
policeman
polyandrist
polycarp
polygynist
ponce
ponce_de_leon
pope
popper
poseuse
posseman
poster_boy
poster_girl
postmistress
potboy
poultryman
praetor
priest
priestess
prima_ballerina
prima_donna
primigravida
primipara
prince_consort
prince_of_wales
princeling
princeling
princess
princess_royal
proconsul
procuress
property_man
prophetess
proprietress
protegee
puerpera
quadripara
quarryman
queen
queen
queen
queen_consort
queen_dowager
queen_mother
queen_of_england
queen_regent
quintipara
raftsman
raja
rake
rani
remittance_man
renaissance_man
renaissance_man
repairman
rhea_silvia
rifleman
rifleman
right-hand_man
ring_girl
roadman
roman
roman
roman_emperor
romeo
rosebud
roundsman
sadhu
salesgirl
salesman
samurai
sandboy
sandwichman
sannup
satyr
schoolboy
schoolgirl
schoolman
schoolmarm
scold
scotswoman
sculptress
sea_scout
second_baseman
section_man
secundigravida
seducer
seductress
seedsman
selectman
selectwoman
senhor
servant_girl
serviceman
sex_kitten
shah
shaheed
shaver
she
she-devil
sheepman
sheik
sheika
shepherdess
shiksa
shop_boy
shop_girl
showman
showman
shrew
sibyl
sibyl
sidesman
signalman
signor
signora
signore
signorina
simeon
sir
sir
sire
sirrah
sister
sister
sister
sister-in-law
skivvy
slattern
small_businessman
smasher
sod
sodomite
son
son-in-law
songstress
soprano
sorceress
soubrette
soul_brother
soundman
spinster
spitfire
spokesman
spokeswoman
sporting_man
sporting_man
squaw
squaw_man
squire
squire
stableman
starlet
statesman
stateswoman
stepbrother
stepdaughter
stepfather
stepmother
stepson
stewardess
stiff
stockman
straight_man
street_arab
strongman
strongman
stud
stuffed_shirt
subdeacon
suffragette
sugar_daddy
suitor
sultan
sumo_wrestler
supermom
surrogate_mother
swagman
sweater_girl
sylph
t-man
tallyman
tallyman
tarzan
taskmistress
taxi_dancer
tenor
tertigravida
test-tube_baby
testatrix
thane
thane
third_baseman
thrush
timberman
toast_mistress
tom
tomboy
torch_singer
town
townee
townes
townsman
townsman
trainbandsman
trainman
traitress
trappist
traveling_salesman
tribesman
trophy_wife
uncle
uncle
undoer
unmarried_woman
unpleasant_woman
uriah
usherette
utility_man
utility_man
uxor
uxoricide
valley_girl
vaquero
vestal
vestal_virgin
vestryman
vestrywoman
vicar
vicar
vicar
vicar_apostolic
vicar-general
vice_chairman
villainess
virago
viscount
viscount
viscountess
viscountess
visiting_fireman
vizier
wac
waitress
wanton
war_bride
war_widow
wardress
warlord
washerman
washwoman
watchman
water_boy
weatherman
welshman
wencher
wet_nurse
white_man
white_slave
white_woman
widow
widower
wife
wild_man
wingman
wireman
wittol
wolf
wolf_boy
woman
woman
womanizer
women
wonder_boy
wonder_woman
woodsman
working_girl
workman
yachtsman
yardman
yardman
yellow_man
yellow_woman
yenta
yeoman
yeoman
